Config/Catalogs/IdentityCardsSystemParameters.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>IdentityCardsSystemParameters</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CardReaderType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CardReaderTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LogicalDeviceNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Port</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaudRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Parity</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ParityTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataBits</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DataBits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StopBits</Name>
					<Type>
						<v8:Type>cfg:EnumRef.StopBits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Suffix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShowAllClientsInTheRoom</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletePreviousClientCardsBeforeIssuingNew</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IssueCardsForAllGuestsInTheRoom</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IdentificationCardType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IdentificationCardTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseDeleted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalInteraction</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalSystemInteractions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConnectionParameters</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HardwareDriver</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HardwareDrivers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/CardReaderTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CardReaderTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>RS232</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RS232_1C</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PS2Keyboard</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IronLogicZ2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ISD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NativeDriver1C</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/IdentityCardsSystemParameters/Forms/tcItemForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// -----------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	RefreshDisplay();
EndProcedure

// -----------------------------------------------------------------------------
&AtServer
Procedure FillCheckProcessingAtServer(pCancel, pCheckedAttributes)
	If Object.CardReaderType = Enums.CardReaderTypes.ISD And Not ValueIsFilled(Object.ExternalInteraction) Then
		Message = New UserMessage;
		Message.Text = NStr("en = 'It is necessary to fill in the ISD connection settings'; 
							|de = 'Es ist notwendig, die ISD-Verbindungseinstellungen einzugeben'; 
							|ru = 'Необходимо заполнить настройки подключения к ISD'");
		Message.Field = "Object.ExternalInteraction";
		Message.Message();
		pCancel = True;
	EndIf;	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure CardReaderTypeOnChange(Item)
	RefreshDisplay();
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

//-----------------------------------------------------------------------------
&AtClient
Procedure OpenHardwareSettings(Command)
	If Modified And Not Write() Then
		Return;
	EndIf;
	
	OpenForm("CommonForm.tcHardwareDriverSettings", New Structure("Hardware", Object.Ref), ThisObject, UUID, , , New NotifyDescription("OpenHardwareSettingsEnd", ThisObject));
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure CheckConnection(pCommand)
	If Not ValueIsFilled(Object.CardReaderType) Then
		ShowMessageBox(, NStr("en = 'driver type should be filled!'; de = 'Wählen Sie den Typ des Fahrer'; ru = 'Выберите тип драйвера!'"));
		Return;
	EndIf;
	
	If Modified And Not Write() Then
		Return;
	EndIf;
	
	OpenForm("CommonForm.tcTestConnectionCardReader", New Structure("IdentityCardsSystemParameter", Object.Ref), ThisObject, UUID);
EndProcedure // CheckConnection

#EndRegion

#Region Private

// -----------------------------------------------------------------------------
&AtServer
Procedure RefreshDisplay()
	Items.HardwareDriver.Visible = False;
	Items.FormOpenHardwareSettings.Visible = False;
	Items.GroupParameters.Visible = True;
	If Object.CardReaderType = Enums.CardReaderTypes.NativeDriver1C Then
		Items.HardwareDriver.Visible = True;
		Items.FormOpenHardwareSettings.Visible = True;
		Items.GroupParameters.Visible = False;
	ElsIf Object.CardReaderType = Enums.CardReaderTypes.IronLogicZ2 Then
		If Not IsBlankString(Object.Prefix) Then
			Object.Prefix = "";
		EndIf;
		If Not IsBlankString(Object.Suffix) Then
			Object.Suffix = "";
		EndIf;
		Items.Prefix.Enabled = False;
		Items.Suffix.Enabled = False;
	Else
		Items.Prefix.Enabled = True;
		Items.Suffix.Enabled = True;
	EndIf;
EndProcedure // RefreshDisplay

// --------------------------------------------------------------------------------
&AtClient
Procedure OpenHardwareSettingsEnd(pValue, pExtraParams) Export
	Read();
EndProcedure // OpenHardwareSettings

#EndRegion
